{"config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 70, 320, 3], "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "bias": true, "b_regularizer": null, "border_mode": "same", "nb_row": 8, "name": "convolution2d_1", "nb_filter": 16, "activation": "tanh", "subsample": [4, 4], "W_regularizer": null, "W_constraint": null, "nb_col": 8, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "border_mode": "same", "name": "convolution2d_2", "nb_filter": 32, "activation": "tanh", "subsample": [2, 2], "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "border_mode": "same", "name": "convolution2d_3", "nb_filter": 64, "activation": "tanh", "subsample": [2, 2], "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "nb_row": 5}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "output_dim": 512, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_1", "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "tanh", "W_constraint": null, "input_dim": 6400}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "output_dim": 128, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_2", "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "tanh", "W_constraint": null, "input_dim": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "output_dim": 1, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "activation": "tanh", "W_constraint": null, "input_dim": 128}}], "class_name": "Sequential", "keras_version": "1.2.2"}