{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_regularizer": null, "input_dtype": "float32", "nb_filter": 16, "dim_ordering": "tf", "nb_col": 8, "b_constraint": null, "bias": true, "border_mode": "same", "activation": "tanh", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 70, 320, 3], "nb_row": 8, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "subsample": [4, 4]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "bias": true, "border_mode": "same", "activation": "tanh", "activity_regularizer": null, "trainable": true, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "bias": true, "border_mode": "same", "activation": "tanh", "activity_regularizer": null, "trainable": true, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "activation": "tanh", "activity_regularizer": null, "trainable": true, "input_dim": 6400, "output_dim": 512, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "activation": "tanh", "activity_regularizer": null, "trainable": true, "input_dim": 512, "output_dim": 128, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "activation": "tanh", "activity_regularizer": null, "trainable": true, "input_dim": 128, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null}}]}